docs/Win32_OperatingSystem-2.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration">
    <env:Header />
    <env:Body>
        <n:PullReponse>
            <n:Items>
                <p:Win32_OperatingSystem xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wmi/root/cimv2/Win32_OperatingSystem" xmlns:cim="http://schemas.dmtf.org/wbem/wscim/1/common" xsi:type="p:Win32_OperatingSystem_Type">
                    <p:BootDevice>\Device\HarddiskVolume1</p:BootDevice>
                    <p:BuildNumber>14393</p:BuildNumber>
                    <p:BuildType>Multiprocessor Free</p:BuildType>
                    <p:Caption>Microsoft Windows Server 2016 Datacenter</p:Caption>
                    <p:CodeSet>1252</p:CodeSet>
                    <p:CountryCode>1</p:CountryCode>
                    <p:CreationClassName>Win32_OperatingSystem</p:CreationClassName>
                    <p:CSCreationClassName>Win32_ComputerSystem</p:CSCreationClassName>
                    <p:CSDVersion xsi:nil="true" />
                    <p:CSName>SMNNOVCTXVDA1</p:CSName>
                    <p:CurrentTimeZone>-300</p:CurrentTimeZone>
                    <p:DataExecutionPrevention_32BitApplications>true</p:DataExecutionPrevention_32BitApplications>
                    <p:DataExecutionPrevention_Available>true</p:DataExecutionPrevention_Available>
                    <p:DataExecutionPrevention_Drivers>true</p:DataExecutionPrevention_Drivers>
                    <p:DataExecutionPrevention_SupportPolicy>3</p:DataExecutionPrevention_SupportPolicy>
                    <p:Debug>false</p:Debug>
                    <p:Description />
                    <p:Distributed>false</p:Distributed>
                    <p:EncryptionLevel>256</p:EncryptionLevel>
                    <p:ForegroundApplicationBoost>2</p:ForegroundApplicationBoost>
                    <p:FreePhysicalMemory>793176</p:FreePhysicalMemory>
                    <p:FreeSpaceInPagingFiles>2098588</p:FreeSpaceInPagingFiles>
                    <p:FreeVirtualMemory>1905724</p:FreeVirtualMemory>
                    <p:InstallDate>
                        <cim:Datetime>2019-03-07T18:49:07-05:00</cim:Datetime>
                    </p:InstallDate>
                    <p:LargeSystemCache xsi:nil="true" />
                    <p:LastBootUpTime>
                        <cim:Datetime>2023-01-16T00:40:47.484411-05:00</cim:Datetime>
                    </p:LastBootUpTime>
                    <p:LocalDateTime>
                        <cim:Datetime>2023-01-19T09:44:30.799-05:00</cim:Datetime>
                    </p:LocalDateTime>
                    <p:Locale>0409</p:Locale>
                    <p:Manufacturer>Microsoft Corporation</p:Manufacturer>
                    <p:MaxNumberOfProcesses>4294967295</p:MaxNumberOfProcesses>
                    <p:MaxProcessMemorySize>137438953344</p:MaxProcessMemorySize>
                    <p:MUILanguages>en-US</p:MUILanguages>
                    <p:Name>Microsoft Windows Server 2016 Datacenter|C:\Windows|\Device\Harddisk0\Partition2</p:Name>
                    <p:NumberOfLicensedUsers>0</p:NumberOfLicensedUsers>
                    <p:NumberOfProcesses>292</p:NumberOfProcesses>
                    <p:NumberOfUsers>32</p:NumberOfUsers>
                    <p:OperatingSystemSKU>8</p:OperatingSystemSKU>
                    <p:Organization />
                    <p:OSArchitecture>64-bit</p:OSArchitecture>
                    <p:OSLanguage>1033</p:OSLanguage>
                    <p:OSProductSuite>144</p:OSProductSuite>
                    <p:OSType>18</p:OSType>
                    <p:OtherTypeDescription xsi:nil="true" />
                    <p:PAEEnabled xsi:nil="true" />
                    <p:PlusProductID xsi:nil="true" />
                    <p:PlusVersionNumber xsi:nil="true" />
                    <p:PortableOperatingSystem>false</p:PortableOperatingSystem>
                    <p:Primary>true</p:Primary>
                    <p:ProductType>3</p:ProductType>
                    <p:RegisteredUser>Windows User</p:RegisteredUser>
                    <p:SerialNumber>00376-50001-24186-AA854</p:SerialNumber>
                    <p:ServicePackMajorVersion>0</p:ServicePackMajorVersion>
                    <p:ServicePackMinorVersion>0</p:ServicePackMinorVersion>
                    <p:SizeStoredInPagingFiles>3072044</p:SizeStoredInPagingFiles>
                    <p:Status>OK</p:Status>
                    <p:SuiteMask>144</p:SuiteMask>
                    <p:SystemDevice>\Device\HarddiskVolume2</p:SystemDevice>
                    <p:SystemDirectory>C:\Windows\system32</p:SystemDirectory>
                    <p:SystemDrive>C:</p:SystemDrive>
                    <p:TotalSwapSpaceSize xsi:nil="true" />
                    <p:TotalVirtualMemorySize>11460108</p:TotalVirtualMemorySize>
                    <p:TotalVisibleMemorySize>8388064</p:TotalVisibleMemorySize>
                    <p:Version>10.0.14393</p:Version>
                    <p:WindowsDirectory>C:\Windows</p:WindowsDirectory>
                </p:Win32_OperatingSystem>
            </n:Items>
        </n:PullReponse>
    </env:Body>
</env:Envelope>